// ممنوع إستخدام الأرقام نهائيا ويمكنك إستخدام قيم المتغيرات مع ما تعلمته لتنفيذ المطلوب
// يجب طباعة الأرقام كما في المثال والتوقف عند الرقم 3
// إذا كان الرقم اصغر من 10 قم بطباعة صفر قبله
// يجب إستخدام ال Loop For لعمل المطلوب

let start = 10;
let end = 0;
let stop = 3;
/*
// Output
10;
09;
08;
07;
06;
05;
04;
03;
*/
for (let i = start; i > end; i--) {
  if (i < start) {
    console.log(`${end}` + i);
    if (i === stop) {
      break;
    }
  } else {
    console.log(i);
  }
}
